const generateSingleStanza = () => {
    let string = ''
    for (let i = 99; i > 0; i--) {
        if(i == 2 || i == 3 || i == 4 || i == 22 || i == 23 || i == 24 || i == 32 || i == 33 
            || i == 34 || i == 42 || i == 43 || i == 44 || i == 52 || i == 53 || i == 54
            || i == 62 || i == 63 || i == 64 || i == 72 || i == 73 || i == 74 || i == 82 
            || i == 83 || i == 84 || i == 92 || i == 93 || i == 94) { 
        string += `${i} бутылки пива на стене, ${i} бутылки пива! \nВозьми одну, пусти по кругу, ${i - 1} бутылки пива на стене!\n \n`
    } else if (i == 1 || i == 21 || i == 31 || i == 41 || i == 51 || i == 61 || i == 71 || i == 81 || i == 91) {
        string += `${i} бутылка пива на стене, ${i} бутылка пива! \nВозьми одну, пусти по кругу, ${i - 1} бутылок пива на стене!\n \n`
    } else {
        string += `${i} бутылок пива на стене, ${i} бутылок пива! \nВозьми одну, пусти по кругу, ${i - 1} бутылок пива на стене! \n \n`
    } 
        }
        return string
    }
   

 console.log(generateSingleStanza()) 